https://code.visualstudio.com/docs/editor/extension-gallery

Extensions are installed in a per user extensions folder. Depending on your platform, the location is in the following folder:

Windows %USERPROFILE%\.vscode\extensions
macOS ~/.vscode/extensions
Linux ~/.vscode/extensions

code --list-extensions
code --install-extension

My current list:

abusaidm.html-snippets
agurz.markdown-latex-renderer
alefragnani.Bookmarks
anseki.vscode-color
azemoh.one-monokai
bpruitt-goddard.mermaid-markdown-syntax-highlighting
danwahlin.angular2-snippets
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.githistory
DotJoshJohnson.xml
ecmel.vscode-html-css
EdgardMessias.clipboard-manager
eridem.vscode-nupkg
GrapeCity.gc-excelviewer
HookyQR.beautify
humao.rest-client
johnpapa.vscode-peacock
mauve.terraform
ms-azure-devops.azure-pipelines
ms-azuretools.vscode-azureterraform
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-mssql.mssql
ms-vscode-remote.remote-wsl
ms-vscode.azure-account
ms-vscode.azurecli
ms-vscode.csharp
ms-vscode.powershell
ms-vscode.vs-keybindings
msazurermtools.azurerm-vscode-tools
msjsdiag.debugger-for-chrome
msjsdiag.vscode-react-native
redhat.vscode-yaml
ryu1kn.partial-diff
sidthesloth.html5-boilerplate
tintoy.msbuild-project-tools
tomoki1207.pdf
vscode-icons-team.vscode-icons
vstirbu.vscode-mermaid-preview
Zignd.html-css-class-completion
