https://code.visualstudio.com/docs/editor/extension-gallery

Extensions are installed in a per user extensions folder. Depending on your platform, the location is in the following folder:

Windows %USERPROFILE%\.vscode\extensions
macOS ~/.vscode/extensions
Linux ~/.vscode/extensions

code --list-extensions
code --install-extension <extension id or file path>
code --uninstall-extension <extension id or file path>

My current list:

code --install-extension agurz.markdown-latex-renderer
code --install-extension alefragnani.Bookmarks
code --install-extension anseki.vscode-color
code --install-extension bpruitt-goddard.mermaid-markdown-syntax-highlighting
code --install-extension DavidAnson.vscode-markdownlint
code --install-extension dbaeumer.vscode-eslint
code --install-extension donjayamanne.githistory
code --install-extension eridem.vscode-nupkg
code --install-extension johnpapa.vscode-peacock
code --install-extension ms-azure-devops.azure-pipelines
code --install-extension ms-azuretools.vscode-docker
code --install-extension ms-mssql.mssql
code --install-extension ms-vscode.azure-account
code --install-extension ms-vscode.azurecli
code --install-extension ms-vscode.powershell
code --install-extension ms-vscode.vs-keybindings
code --install-extension ms-vscode-remote.remote-ssh
code --install-extension msjsdiag.debugger-for-chrome
code --install-extension msjsdiag.vscode-react-native
code --install-extension redhat.vscode-yaml
code --install-extension ryu1kn.partial-diff
code --install-extension sidthesloth.html5-boilerplate
code --install-extension tintoy.msbuild-project-tools
code --install-extension vscode-icons-team.vscode-icons

# Reference:
https://stackoverflow.com/questions/35773299/how-can-you-export-vs-code-extension-list

code --list-extensions | xargs -L 1 echo code --install-extension
