# Extensions Website:
# https://code.visualstudio.com/docs/editor/extension-gallery

# Extensions are installed in a per user extensions folder. Depending on your platform, the location is in the following folder:
# Windows %USERPROFILE%\.vscode\extensions
# MacOS ~/.vscode/extensions
# Linux ~/.vscode/extensions

# For Reference:
# https://stackoverflow.com/questions/35773299/how-can-you-export-vs-code-extension-list

# code --list-extensions
# Or, format that same output with the CLI install command
# code --list-extensions | xargs -L 1 echo code --install-extension
# Install an extension at the CLI
# code --install-extension <extension id or file path>

Running list:

# Fun stuff
code --install-extension johnpapa.vscode-peacock
code --install-extension DavidAnson.vscode-markdownlint
code --install-extension agurz.markdown-latex-renderer
code --install-extension vscode-icons-team.vscode-icons
code --install-extension monokai.theme-monokai-pro-vscode
code --install-extension redhat.vscode-yaml
code --install-extension mauve.terraform johnpapa.vscode-peacock
code --install-extension hashhar.gitattributes
code --install-extension eriklynd.json-tools

# Web
code --install-extension abusaidm.html-snippets
code --install-extension alefragnani.Bookmarks
code --install-extension azemoh.one-monokai
code --install-extension bpruitt-goddard.mermaid-markdown-syntax-highlighting
code --install-extension sidthesloth.html5-boilerplate
code --install-extension msjsdiag.debugger-for-chrome

# Markdown/Docs
code --install-extension dbaeumer.vscode-eslint
code --install-extension donjayamanne.githistory
code --install-extension humao.rest-client

# Azure
code --install-extension ms-vscode.azure-account
code --install-extension ms-vscode.azurecli

# Infra
code --install-extension mauve.terraform
code --install-extension ms-azure-devops.azure-pipelines
code --install-extension ms-azuretools.vscode-docker
code --install-extension ms-kubernetes-tools.vscode-kubernetes-tools

# Data
# code --install-extension ms-mssql.mssql

# Dev
code --install-extension ms-vscode.csharp
code --install-extension ms-vscode.powershell
code --install-extension ms-python.python
# code --install-extension tintoy.msbuild-project-tools
code --install-extension eridem.vscode-nupkg
code --install-extension EditorConfig.EditorConfig